; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 453306 1 2 4 8 6
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	infrared0 - mode
	spectrograph2 - mode
	infrared1 - mode
	image3 - mode
	Star0 - direction
	Star3 - direction
	Star4 - direction
	GroundStation5 - direction
	GroundStation7 - direction
	Star1 - direction
	Star2 - direction
	Star6 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Star13 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 image3)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star1)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared1)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
)
(:goal (and
	(have_image Planet8 image3)
	(have_image Planet9 image3)
	(have_image Star10 image3)
	(have_image Planet11 infrared0)
	(have_image Star12 infrared1)
	(have_image Star13 infrared1)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (turn_to satellite0 star6 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 star6)
   goals met: 0 of 6
3. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 6
4. (turn_to satellite0 star12 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star12)
   goals met: 0 of 6
5. (take_image satellite0 star12 instrument1 infrared1)
   added: (have_image star12 infrared1)
   goals met: 1 of 6
6. (turn_to satellite0 star10 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star10)
   goals met: 1 of 6
7. (turn_to satellite0 planet11 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet11)
   goals met: 1 of 6
8. (take_image satellite0 planet11 instrument1 infrared0)
   added: (have_image planet11 infrared0)
   goals met: 2 of 6
9. (turn_to satellite0 star10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 star10)
   goals met: 2 of 6
10. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 2 of 6
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 6
12. (turn_to satellite0 star1 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star1)
   goals met: 2 of 6
13. (calibrate satellite0 instrument0 star1)
   added: (calibrated instrument0)
   goals met: 2 of 6
14. (turn_to satellite0 star10 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star10)
   goals met: 2 of 6
15. (take_image satellite0 star10 instrument0 image3)
   added: (have_image star10 image3)
   goals met: 3 of 6
16. (turn_to satellite0 planet9 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet9)
   goals met: 3 of 6
17. (take_image satellite0 planet9 instrument0 image3)
   added: (have_image planet9 image3)
   goals met: 4 of 6
18. (turn_to satellite0 planet8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 planet8)
   goals met: 4 of 6
19. (take_image satellite0 planet8 instrument0 image3)
   added: (have_image planet8 image3)
   goals met: 5 of 6
20. (turn_to satellite0 star13 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star13)
   goals met: 5 of 6
21. (take_image satellite0 star13 instrument0 infrared1)
   added: (have_image star13 infrared1)
   goals met: 6 of 6
